In [1]:
import pandas as pd
import numpy as np

In [11]:
technologies =  {
        'Courses':['Spark','Java','Hadoop','Python', np.nan],
        'Fee'    :[2000, np.nan, 26000, 24000, np.nan],
        'Duration':['30 days', np.nan, '35 days', '40 days', np.nan],
        'Discount':[1000, np.nan,2500, None, np.nan]
    }

In [12]:
technologies

{'Courses': ['Spark', 'Java', 'Hadoop', 'Python', nan],
 'Fee': [2000, nan, 26000, 24000, nan],
 'Duration': ['30 days', nan, '35 days', '40 days', nan],
 'Discount': [1000, nan, 2500, None, nan]}

In [30]:
df = pd.DataFrame(technologies)

In [31]:
df

  Courses      Fee Duration  Discount
0   Spark   2000.0  30 days    1000.0
1    Java      NaN      NaN       NaN
2  Hadoop  26000.0  35 days    2500.0
3  Python  24000.0  40 days       NaN
4     NaN      NaN      NaN       NaN

In [32]:
df[ ['Courses', 'Fee'] ]

  Courses      Fee
0   Spark   2000.0
1    Java      NaN
2  Hadoop  26000.0
3  Python  24000.0
4     NaN      NaN

In [33]:
print(df)

  Courses      Fee Duration  Discount
0   Spark   2000.0  30 days    1000.0
1    Java      NaN      NaN       NaN
2  Hadoop  26000.0  35 days    2500.0
3  Python  24000.0  40 days       NaN
4     NaN      NaN      NaN       NaN

In [34]:
df2 = df.dropna()  #drop rows that has NaN or None values

In [35]:
print(df2)

  Courses      Fee Duration  Discount
0   Spark   2000.0  30 days    1000.0
2  Hadoop  26000.0  35 days    2500.0

In [36]:
df3 = df.dropna(axis=0)

In [37]:
df3

  Courses      Fee Duration  Discount
0   Spark   2000.0  30 days    1000.0
2  Hadoop  26000.0  35 days    2500.0

In [38]:
df4 = df.dropna(axis=1)

In [39]:
df4

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [53]:
df5 = df.dropna().reset_index(drop=True)  # reset the index, delete the origial index  number

In [54]:
df5

  Courses      Fee Duration  Discount
0   Spark   2000.0  30 days    1000.0
1  Hadoop  26000.0  35 days    2500.0

In [57]:
df6 = df.dropna(how='all')   # 'all' means drop rows where NaN/None is present on any element.

In [58]:
df6

  Courses      Fee Duration  Discount
0   Spark   2000.0  30 days    1000.0
1    Java      NaN      NaN       NaN
2  Hadoop  26000.0  35 days    2500.0
3  Python  24000.0  40 days       NaN

In [60]:
df7 = df.dropna(subset=['Courses','Fee'])

In [61]:
df7

  Courses      Fee Duration  Discount
0   Spark   2000.0  30 days    1000.0
2  Hadoop  26000.0  35 days    2500.0
3  Python  24000.0  40 days       NaN

In [62]:
df

  Courses      Fee Duration  Discount
0   Spark   2000.0  30 days    1000.0
1    Java      NaN      NaN       NaN
2  Hadoop  26000.0  35 days    2500.0
3  Python  24000.0  40 days       NaN
4     NaN      NaN      NaN       NaN

In [65]:
df.dropna(inplace=True)  # instead of returning a new DataFrame, 
# inplace = True drop exiting dataframe

In [66]:
df

  Courses      Fee Duration  Discount
0   Spark   2000.0  30 days    1000.0
2  Hadoop  26000.0  35 days    2500.0